JoshuaCurry/arduino-loraboard/loraboard/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cache=Cache

# Adafruit Circuit Playground M0
# ------------------------------
loraboard.name=LoRaBoard
loraboard.upload.tool=bossac
loraboard.upload.protocol=sam-ba
loraboard.upload.maximum_size=262144
loraboard.upload.offset=0x2000
loraboard.upload.use_1200bps_touch=true
loraboard.upload.wait_for_upload_port=true
loraboard.upload.native_usb=true
loraboard.build.mcu=cortex-m0plus
loraboard.build.f_cpu=48000000L
loraboard.build.usb_product="LoRaBoard"
loraboard.build.usb_manufacturer="Test"
loraboard.build.board=SAMD_CIRCUITPLAYGROUND_EXPRESS
loraboard.build.core=arduino
loraboard.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21G18A__ -DARM_MATH_CM0PLUS -DADAFRUIT_CIRCUITPLAYGROUND_M0 {build.usb_flags}
loraboard.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
loraboard.build.openocdscript=openocd_scripts/arduino_zero.cfg
loraboard.build.variant=loraboard
loraboard.build.variant_system_lib=
loraboard.build.vid=0x239A
loraboard.build.pid=0x8018
loraboard.bootloader.tool=openocd